import pandas as pd
import os 

# 1 : 잔, 2: 병, 3: 캔, 4: cc


data_path = "/workspace/source/Neurodigm/Data/"

survey = pd.read_parquet(os.path.join(data_path, "Data_Survey_Neurodigm_tmp_Train.parquet"))
survey_match = pd.read_excel(os.path.join(data_path, "Survey_Codebook_MODIFIED_250331.xlsx"), engine="openpyxl")
print(f"*************************Loaded survey data*************************")

name_tmp = []
for i in range(len(survey_match)):
    tmp = f"{str(survey_match['Category1'][i])}_{str(survey_match['Category2'][i])}_{str(survey_match['Name1'][i])}"
    tmp = tmp.replace(" ","")
    name_tmp.append(tmp)

survey_dict = dict(zip(survey_match['INQRCD'], name_tmp))

survey = survey.drop(columns='G051301')
survey.rename(columns={'G0806':'비만_2.비만처방_귀하는_과체중'}, inplace=True)
survey.rename(columns={'G0807':'비만_2.비만처방_귀하는_복부비만'}, inplace=True)

for k, v in survey_dict.items():
    survey.rename(columns={k:v}, inplace=True)

print(f"******************************Replaced column name******************************")

survey['YEAR'] = survey['ORDDD(검진일자)'].apply(lambda x: str(x)[:4])
survey = survey.sort_values(by=["S_PID", "ORDDD(검진일자)"], ascending=[True, True]).reset_index(drop=True)
year_list = ['2021', '2022', '2023']
rename_Result = survey[survey['YEAR'].isin(year_list)].reset_index(drop=True)
print(f"******************************Filtered 2021~2023******************************")

print(f"******************************Starting Fillna & Remove Outlier******************************")

clean_dict = {'G1001': ['과거력_1.뇌졸중_진단', 'mode_1'], 
 'G1002': ['과거력_1.뇌졸중_현재약물치료', 'mode_1'],
 'G1003': ['과거력_2.심장병(심근경색및협심증)_진단', 'mode_1'],
 'G1004': ['과거력_2.심장병(심근경색및협심증)_현재약물치료', 'mode_1'],
 'G1005': ['과거력_3.고혈압_진단', 'mode_1'],
 'G1006': ['과거력_3.고혈압_현재약물치료', 'mode_1'],
 'G1007': ['과거력_4.당뇨병_진단', 'mode_1'],
 'G1008': ['과거력_4.당뇨병_현재약물치료', 'mode_1'],
 'G1009': ['과거력_5.이상지질혈증_진단', 'mode_1'],
 'G1010': ['과거력_5.이상지질혈증_현재약물치료', 'mode_1'],
 'G1011': ['과거력_6.폐결핵_진단', 'mode_1'],
 'G1012': ['과거력_6.폐결핵_현재약물치료', 'mode_1'],
 'G1013': ['과거력_7.기타,암포함_진단', 'mode_1'],
 'G1014': ['과거력_7.기타,암포함_현재약물치료', 'mode_1'],
 'G1021': ['가족력_1.뇌졸중_진단', 'mode_1'],
 'G1022': ['가족력_2.심장병(심근경색및협심증)_진단', 'mode_1'],
 'G1023': ['가족력_3.고혈압_진단', 'mode_1'],
 'G1024': ['가족력_4.당뇨병_진단', 'mode_1'],
 'G1025': ['가족력_5.기타,암포함_진단', 'mode_1'],
 'G1041': ['흡연_1.일반담배_흡연력_평생', 'pass'],
 'G104102': ['흡연_1.일반담배_흡연기간', 'pass'],
 'G104103': ['흡연_1.일반담배_흡연량', 'pass'],
 'G104104': ['흡연_1.일반담배_금연기간', 'pass'],
 'G1042': ['흡연_2.궐련형전자담배_흡연력_평생', 'pass'],
 'G104202': ['흡연_2.궐련형전자담배_흡연기간', 'pass'],
 'G104203': ['흡연_2.궐련형전자담배_흡연량', 'pass'],
 'G104204': ['흡연_2.궐련형전자담배_금연기간', 'pass'],
 'G1043': ['흡연_3.액상형전자담배_흡연력_평생', 'pass'],
 'G104301': ['흡연_3.액상형전자담배_흡연력_최근한달', 'pass'],
 'G1051': ['음주_1.음주횟수_일주일', 'pass'],
 'G105201': ['음주_2.평균음주량_소주(단위)', 'pass'],
 'G105202': ['음주_2.평균음주량_소주(양)', 'pass'],
 'G105203': ['음주_2.평균음주량_맥주(단위)', 'pass'],
 'G105204': ['음주_2.평균음주량_맥주(양)', 'pass'],
 'G105205': ['음주_2.평균음주량_양주(단위)', 'pass'],
 'G105206': ['음주_2.평균음주량_양주(양)', 'pass'],
 'G105207': ['음주_2.평균음주량_막걸리(단위)', 'pass'],
 'G105208': ['음주_2.평균음주량_막걸리(양)', 'pass'],
 'G105209': ['음주_2.평균음주량_와인(단위)', 'pass'],
 'G105210': ['음주_2.평균음주량_와인(양)', 'pass'],
 'G105301': ['음주_3.최대음주량_소주(단위)', 'pass'],
 'G105302': ['음주_3.최대음주량_소주(양)', 'pass'],
 'G105303': ['음주_3.최대음주량_맥주(단위)', 'pass'],
 'G105304': ['음주_3.최대음주량_맥주(양)', 'pass'],
 'G105305': ['음주_3.최대음주량_양주(단위)', 'pass'],
 'G105306': ['음주_3.최대음주량_양주(양)', 'pass'],
 'G105307': ['음주_3.최대음주량_막걸리(단위)', 'pass'],
 'G105308': ['음주_3.최대음주량_막걸리(양)', 'pass'],
 'G105309': ['음주_3.최대음주량_와인(단위)', 'pass'],
 'G105310': ['음주_3.최대음주량_와인(양)', 'pass'],
 'G1061': ['신체활동_1.고강도_일주일', 'pass'],
 'G106201': ['신체활동_1.고강도_하루_시간', 'pass'],
 'G106202': ['신체활동_1.고강도_하루_분', 'pass'],
 'G1063': ['신체활동_2.중강도_일주일', 'pass'],
 'G106401': ['신체활동_2.중강도_하루_시간', 'pass'],
 'G106402': ['신체활동_2.중강도_하루_분', 'pass'],
 'G1065': ['신체활동_3.근력운동_일주일', 'pass'],
 'G1071': ['생애전환기(66세)_1.예방접종_독감', 'pass'],
 'G1072': ['생애전환기(66세)_1.예방접종_폐렴', 'pass'],
 'G107301': ['생애전환기(66세)_3.일상생활수행능력_식사', 'pass'],
 'G107302': ['생애전환기(66세)_3.일상생활수행능력_옷', 'pass'],
 'G107303': ['생애전환기(66세)_3.일상생활수행능력_대소변', 'pass'],
 'G107304': ['생애전환기(66세)_3.일상생활수행능력_목욕', 'pass'],
 'G107305': ['생애전환기(66세)_3.일상생활수행능력_식사준비', 'pass'],
 'G107306': ['생애전환기(66세)_3.일상생활수행능력_외출', 'pass'],
 'G1074': ['생애전환기(66세)_4.낙상_6개월', 'pass'],
 'G1075': ['생애전환기(66세)_5.소변_소변장애', 'pass'],
 'G30311': ['가족력_1.위암_본인', 'mode_2'],
 'G30312': ['가족력_1.위암_부모', 'mode_2'],
 'G30313': ['가족력_1.위암_형제', 'mode_2'],
 'G30314': ['가족력_1.위암_자매', 'mode_2'],
 'G30315': ['가족력_1.위암_자녀', 'mode_2'],
 'G30321': ['가족력_2.유방암_본인', 'mode_2'],
 'G30322': ['가족력_2.유방암_부모', 'mode_2'],
 'G30323': ['가족력_2.유방암_형제', 'mode_2'],
 'G30324': ['가족력_2.유방암_자매', 'mode_2'],
 'G30325': ['가족력_2.유방암_자녀', 'mode_2'],
 'G30331': ['가족력_3.대장암_본인', 'mode_2'],
 'G30332': ['가족력_3.대장암_부모', 'mode_2'],
 'G30333': ['가족력_3.대장암_형제', 'mode_2'],
 'G30334': ['가족력_3.대장암_자매', 'mode_2'],
 'G30335': ['가족력_3.대장암_자녀', 'mode_2'],
 'G30341': ['가족력_4.간암_본인', 'mode_2'],
 'G30342': ['가족력_4.간암_부모', 'mode_2'],
 'G30343': ['가족력_4.간암_형제', 'mode_2'],
 'G30344': ['가족력_4.간암_자매', 'mode_2'],
 'G30345': ['가족력_4.간암_자녀', 'mode_2'],
 'G30351': ['가족력_5.자궁경부암_본인', 'mode_2'],
 'G30352': ['가족력_5.자궁경부암_부모', 'mode_2'],
 'G30353': ['가족력_5.자궁경부암_형제', 'mode_2'],
 'G30354': ['가족력_5.자궁경부암_자매', 'mode_2'],
 'G30355': ['가족력_5.자궁경부암_자녀', 'mode_2'],
 'G30361': ['가족력_6.기타암_질환명', 'mode_2'],
 'G30362': ['가족력_6.기타암_본인', 'mode_2'],
 'G30363': ['가족력_6.기타암_부모', 'mode_2'],
 'G30364': ['가족력_6.기타암_형제', 'mode_2'],
 'G30365': ['가족력_6.기타암_자매', 'mode_2'],
 'G30371': ['가족력_7.폐암_본인', 'mode_2'],
 'G30372': ['가족력_7.폐암_부모', 'mode_2'],
 'G30373': ['가족력_7.폐암_형제', 'mode_2'],
 'G30374': ['가족력_7.폐암_자매', 'mode_2'],
 'G30375': ['가족력_7.폐암_자녀', 'mode_2'],
 'G3041': ['과거력_1.암검사_위_위장조영검사(위장X-선촬영)', 'mode_3'],
 'G3042': ['과거력_1.암검사_위_위내시경', 'mode_3'],
 'G3043': ['과거력_1.암검사_유방_유방촬영', 'mode_3'],
 'G3044': ['과거력_1.암검사_대장_분변잠혈반응검사(대변검사)', 'mode_3'],
 'G3045': ['과거력_1.암검사_대장_대장이중조영검사(대장X-선촬영)', 'mode_3'],
 'G3046': ['과거력_1.암검사_대장_대장내시경', 'mode_3'],
 'G3047': ['과거력_1.암검사_자궁_자궁경부세포검사', 'mode_3'],
 'G3048': ['과거력_1.암검사_간_간초음파', 'mode_3'],
 'G3049': ['과거력_1.암검사_폐_폐암(흉부CT)', 'mode_3'],
 'G3051': ['과거력_2.위장_위궤양', 'mode_2'],
 'G3052': ['과거력_2.위장_위축성위염', 'mode_2'],
 'G3053': ['과거력_2.위장_장상피화생', 'mode_2'],
 'G3054': ['과거력_2.위장_위용종', 'mode_2'],
 'G3055': ['과거력_2.위장_기타', 'mode_2'],
 'G3061': ['과거력_3.대장항문_대장용종(폴립)', 'mode_2'],
 'G3062': ['과거력_3.대장항문_궤양성대장염', 'mode_2'],
 'G3063': ['과거력_3.대장항문_크론병', 'mode_2'],
 'G3064': ['과거력_3.대장항문_치질(치핵,치열)', 'mode_2'],
 'G3065': ['과거력_3.대장항문_기타', 'mode_2'],
 'G3071': ['과거력_4.간_B형간염바이러스', 'mode_2'],
 'G3072': ['과거력_4.간_만성B형간염', 'mode_2'],
 'G3073': ['과거력_4.간_만성C형간염', 'mode_2'],
 'G3074': ['과거력_4.간_간경변', 'mode_2'],
 'G3075': ['과거력_4.간_기타', 'mode_2'],
 'G3151': ['과거력_5.폐_만성폐쇄성폐질환', 'mode_2'],
 'G3152': ['과거력_5.폐_폐결핵', 'mode_2'],
 'G3153': ['과거력_5.폐_폐결절', 'mode_2'],
 'G3154': ['과거력_5.폐_간질성폐질환', 'mode_2'],
 'G3155': ['과거력_5.폐_진폐증', 'mode_2'],
 'G3156': ['과거력_5.폐_기타', 'mode_2'],
 'G309': ['여성력_1.월경_완경여부', 'mode_3'],
 'G310': ['여성력_2.복용_호르몬', 'pass'],
 'G314': ['여성력_2.복용_피임약', 'pass'],
 'G311': ['여성력_3.출산_자녀수', 'pass'],
 'G312': ['여성력_3.출산_수유여부및기간', 'pass'],
 'G313': ['여성력_4.진단_유방양성종양', 'pass'],
 'G0501': ['음주_1.음주상태_음주_빈도_일수', 'pass'],
 'G0503': ['음주_1.음주상태_음주_빈도_일수_6잔(맥주2,000cc이상)', 'pass'],
 'G0504': ['음주_1.음주상태_음주_자제력(지난1년간)', 'pass'],
 'G0505': ['음주_1.음주상태_음주_일상생활(지난1년간)', 'pass'],
 'G0506': ['음주_1.음주상태_과음_해장술(지난1년간)', 'pass'],
 'G0507': ['음주_1.음주상태_음주_후회(지난1년간)', 'pass'],
 'G0508': ['음주_1.음주상태_음주_기억상실(지난1년간)', 'pass'],
 'G0509': ['음주_1.음주상태_음주_신체부상', 'pass'],
 'G0510': ['음주_1.음주상태_금주권고', 'pass'],
 'G0514': ['음주_2.음주처방_금주_절주_처방여부', 'pass'],
 'G05150101': ['음주_2.음주처방_현재음주습관유지', 'pass'],
 'G05150201': ['음주_2.음주처방_음주습관변경', 'pass'],
 'G05150202': ['음주_2.음주처방_회복까지금주', 'pass'],
 'G05150203': ['음주_2.음주처방_완전히금주', 'pass'],
 'G05150301': ['음주_2.음주처방_병원진료_금주보조제_처방', 'pass'],
 'G05150302': ['음주_2.음주처방_병원진료필요', 'pass'],
 'G05130101': ['음주_2.음주처방_평가점수', 'pass'],
 'G05130201': ['음주_3.금주시호전_우울증/불안증', 'pass'],
 'G05130202': ['음주_3.금주시호전_위장관질환', 'pass'],
 'G05130203': ['음주_3.금주시호전_고혈압', 'pass'],
 'G05130204': ['음주_3.금주시호전_심장질환', 'pass'],
 'G05130205': ['음주_3.금주시호전_당뇨병', 'pass'],
 'G05130206': ['음주_3.금주시호전_뇌졸증(중풍)', 'pass'],
 'G05130207': ['음주_3.금주시호전_이상지질혈증(고지혈증)', 'pass'],
 'G0701': ['영양_1.영양생활습관_유제품섭취_매일1컵이상', 'pass'],
 'G0702': ['영양_1.영양생활습관_단백질섭취_매일3회이상', 'pass'],
 'G0703': ['영양_1.영양생활습관_채소섭취_매끼니', 'pass'],
 'G0704': ['영양_1.영양생활습관_과일섭취_매일1개', 'pass'],
 'G0705': ['영양_1.영양생활습관_지방류섭취_빈도', 'pass'],
 'G0706': ['영양_1.영양생활습관_고콜레스테롤식품섭취_빈도', 'pass'],
 'G0707': ['영양_1.영양생활습관_빙과류및과자섭취_매일1개이상', 'pass'],
 'G0708': ['영양_1.영양생활습관_염장식품섭취_매일', 'pass'],
 'G0709': ['영양_1.영양생활습관_규칙적식사', 'pass'],
 'G0710': ['영양_1.영양생활습관_5가지식품군중섭취개수', 'pass'],
 'G0711': ['영양_1.영양생활습관_외식빈도', 'pass'],
 'G0713': ['영양_2.영양처방_현재식생활습관', 'pass'],
 'G071401': ['영양_2.영양처방_식생활습관개선처방_유제품섭취(매일1컵이상)', 'pass'],
 'G071402': ['영양_2.영양처방_식생활습관개선처방_단백질섭취(매일3회이상)', 'pass'],
 'G071403': ['영양_2.영양처방_식생활습관개선처방_채소섭취(매끼니1접시이상)', 'pass'],
 'G071404': ['영양_2.영양처방_식생활습관개선처방_구이,찜,무침요리권장', 'pass'],
 'G071405': ['영양_2.영양처방_식생활습관개선처방_살코기위주섭취권장', 'pass'],
 'G071406': ['영양_2.영양처방_식생활습관개선처방_단순당간식제한', 'pass'],
 'G071407': ['영양_2.영양처방_식생활습관개선처방_염분제한', 'pass'],
 'G071408': ['영양_2.영양처방_식생활습관개선처방_규칙적식사', 'pass'],
 'G071409': ['영양_2.영양처방_식생활습관개선처방_균형잡힌식사', 'pass'],
 'G071410': ['영양_2.영양처방_식생활습관개선처방_외식제한', 'pass'],
 'G071501': ['영양_2.영양처방_영양처방시호전기대질병_고혈압', 'pass'],
 'G071502': ['영양_2.영양처방_영양처방시호전기대질병_당뇨병', 'pass'],
 'G071503': ['영양_2.영양처방_영양처방시호전기대질병_심장질환', 'pass'],
 'G071504': ['영양_2.영양처방_영양처방시호전기대질병_이상지질혈증(고지혈증)', 'pass'],
 'G071505': ['영양_2.영양처방_영양처방시호전기대질병_뇌졸중', 'pass'],
 'G071506': ['영양_2.영양처방_영양처방시호전기대질병_말초혈관질환', 'pass'],
 'G071507': ['영양_2.영양처방_영양처방시호전기대질병_골다공증', 'pass'],
 'G071508': ['영양_2.영양처방_영양처방시호전기대질병_비만/과체중', 'pass'],
 'G071509': ['영양_2.영양처방_영양처방시호전기대질병_통풍', 'pass'],
 'G0802': ['비만_1.비만생활습관_10-20대비교10kg이상체중증가', 'pass'],
 'G0803': ['비만_1.비만생활습관_체중감량시도', 'pass'],
 'G0804': ['비만_1.비만생활습관_정상체중유지관심', 'pass'],
 'G0806': ['비만_2.비만처방_귀하는_과체중', 'pass'],
 'G0807': ['비만_2.비만처방_귀하는_복부비만', 'pass'],
 'G0808': ['비만_2.비만처방_동반질환위험', 'pass'],
 'G080904': ['비만_2.비만처방_목표체중_매달감량체중(kg)', 'pass'],
 'G081001': ['비만_2.비만처방_비만처방_식사량줄이기', 'pass'],
 'G081002': ['비만_2.비만처방_비만처방_간식/야식줄이기', 'pass'],
 'G081003': ['비만_2.비만처방_비만처방_외식/패스트푸드줄이기', 'pass'],
 'G081004': ['비만_2.비만처방_비만처방_흡연', 'pass'],
 'G081005': ['비만_2.비만처방_비만처방_음주', 'pass'],
 'G081006': ['비만_2.비만처방_비만처방_운동', 'pass'],
 'G081007': ['비만_2.비만처방_비만처방_영양', 'pass'],
 'G081008': ['비만_2.비만처방_비만처방_약물치료', 'pass'],
 'G081101': ['비만_2.비만처방_체중감량통한호전기대질병_협심증/심근경색', 'pass'],
 'G081102': ['비만_2.비만처방_체중감량통한호전기대질병_공복혈당장애/당뇨병', 'pass'],
 'G081103': ['비만_2.비만처방_체중감량통한호전기대질병_뇌졸중', 'pass'],
 'G081104': ['비만_2.비만처방_체중감량통한호전기대질병_고혈압', 'pass'],
 'G081105': ['비만_2.비만처방_체중감량통한호전기대질병_이상지질혈증(고지혈증)', 'pass'],
 'G081106': ['비만_2.비만처방_체중감량통한호전기대질병_말초혈관질환', 'pass'],
 'G081107': ['비만_2.비만처방_체중감량통한호전기대질병_수면무호흡증', 'pass'],
 'G081108': ['비만_2.비만처방_체중감량통한호전기대질병_골관절염', 'pass'],
 'G081109': ['비만_2.비만처방_체중감량통한호전기대질병_요실금', 'pass'],
 'G081110': ['비만_2.비만처방_체중감량통한호전기대질병_담낭질환', 'pass']}


col_name = [value[0] for value in clean_dict.values()]

stay = ['S_PID', 'RGSTNO(접수번호)', 'SEX(성별)', 'AGE(나이)', 'BRTHDD(생년월일)', 'ORDDD(검진일자)'] + col_name
survey = survey[stay]

mode_1_list = [value[0] for value in clean_dict.values() if value[1] == 'mode_1']
mode_2_list = [value[0] for value in clean_dict.values() if value[1] == 'mode_2']
mode_3_list = [value[0] for value in clean_dict.values() if value[1] == 'mode_3']
mode_pass_list = [value[0] for value in clean_dict.values() if value[1] == 'pass']

# mode_1
survey[mode_1_list] = survey[mode_1_list].fillna(2).astype(int)

# mode_2
survey[mode_2_list] = survey[mode_2_list].replace({1 : 0, 2 : 1})
survey[mode_2_list] = survey[mode_2_list].fillna(2).astype(int)

# mode_3
survey[mode_3_list] = survey[mode_3_list].notna().astype(int)
for col in mode_3_list:
    mode_val = survey[col].mode()[0]
    survey[col] = survey[col].fillna(mode_val)

# pass _xxxxxxxxxxxxx
for col in mode_pass_list:
    mode_val = survey[col].mode()[0]
    survey[col] = pd.to_numeric(survey[col], errors="coerce")
    survey[col] = survey[col].fillna(mode_val)


print(f"*************************Finished Fillna & Remove Outlier*************************")

survey.to_csv("/workspace/source/code_je/251104/clean_data/Survey.csv", index=False)